app/controllers/blog_controller.rb

SELECT * FROM "entries" ORDER BY created_at desc
---
  def index
    @entries = Entry.all(:order => 'created_at desc')

SELECT * FROM "entries" WHERE ("entries"."id" = '--- :id
---
  def show
    @entry = Entry.find(params[:id])

SELECT * FROM "entries" WHERE ("entries"."id" = 1)
INSERT INTO "comments" ("entry_id", "created_at", "body", "updated_at", "user", "email") VALUES(2, '2010-04-11 03:36:07', 'excellent', '2010-04-11 03:36:07', NULL, NULL)
---
  def add_comment
    @entry = Entry.find(params[:id])
    # @comment = Comment.new(:entry => @entry, :user => params[:user], :body => params[:body])
    @comment = @entry.comments.build(:user => params[:comment][:user], :body => params[:comment][:body], :email => params[:comment][:email])
    if @comment.save